"""
1. 트랜잭션(transaction)과 아이템(item) 
 - 트랜잭션(10개) : 행 
 - 아이템(3개) : 열
"""

'''
Item           bread  butter  milk
User                     
1                1.0     0.0   1.0
2                1.0     1.0   0.0
3                0.0     1.0   1.0
4                1.0     0.0   0.0
5                0.0     1.0   1.0
6                1.0     0.0   0.0
7                0.0     1.0   0.0
8                0.0     0.0   1.0
9                0.0     0.0   1.0
10               1.0     0.0   0.0
'''

"""
2. 지지도(support), 신뢰도(confidence), 향상도(lift)
   선행사건(A) -> 후행사건(B) 
   
   지지도(support) = (A ∩ B) / 전체거래수(순서 없음)
   신뢰도(confidence) = (A ∩ B) / A를 포함한 거래수(순서 존재)
   향상도(lift) = 신뢰도 / B가 포함될 거래율 
"""

'''
예) A{bread} => B{butter} : 빵을 구매한 사람이 버터를 구매할 가능성

선행사건(A) 지지도 = 5 / 10 : A가 발생한 비율   
후행사건(B) 지지도 = 4 / 10 : B가 발생한 비율 
지지도(support) = 1 / 10 = 0.1  : A와 B가 동시에 발생한 비율
신뢰도(confidence) = 1 / 5 = 0.2 : A가 발생했을 때 B가 발생할 조건부 확률
향상도(lift) = 0.2 / 0.4 = 0.5 : 두 항목의 독립성을 고려한 연관 강도
'''














