"""
문) 아래와 같은 6개의 트랜잭션(t1 ~ t6)을 대상으로 주어진 선행사건(LHS)와 후행사건(RHS)에 대한 
    지지도(suport), 신뢰도(confidence), 향상도(lift)를 계산하시오.  


트랜잭션(transactions)
 t1 : 라면,맥주,우유
 t2 : 라면,고기,우유
 t3 : 라면,과일,고기
 t4 : 고기,맥주,우유
 t5 : 라면,고기,우유
 t6 : 과일,우유 
"""

# 지지도(support) = (A ∩ B) / 전체거래수
# 신뢰도(confidence) = (A ∩ B) / A거래수
# 향상도(lift) = confidence / B가 포함될 거래율
# jaccard = (A ∩ B) / A + B - (A ∩ B) 

#  선행사건(LHS)  -> 후행사건(RHS)  지지도(support) 신뢰도(confidence) 향상도(lift)      유사도(jaccard)
#      {맥주}    ->   {고기}         1/6=0.166       1/2=0.5          0.5/(4/6)=0.75  1/((2+4)-1)=0.2            
#      {고기}    ->   {우유}         3/6=0.5         3/4=0.75         0.75/(5/6)=0.9  3/((4+5)-3)=0.5           
#    {라면,우유} ->   {맥주}         1/6=0.166       1/3=0.33         0.33/(2/6)=1    1/((3+2)-1)=0.25                   


