'''
 문2) 다음과 같은 날씨와 비 관계를 나타낸 테이블을 참고하여 Naive Bayes 확률이론을 
      적용한 주어진 확률을 구하시오. 


  <날씨와 비 관계 테이블>  
--------------------------
         yes   no   행합  
--------------------------         
맑은날    2     8    10 = 10/20
흐린날    6     4    10 = 10/20
--------------------------
  열합   8/20  12/20   20
--------------------------  
''' 

### [문제1] 맑은날 비가 올 확률 구하기 
'''
 조건부확률 표현 : P(yes|맑은날) = P(맑은날|yes) * P(yes) / P(맑은날)
'''


# 단계1. 사전확률  
'''
P(맑은날) = 10/20  
P(yes) = 8/20  
'''

# 단계2. 결합확률 
'''
P(맑은날|yes) = 2/8 : 비가 온 경우 맑은날 
'''

# 단계3. 베이즈 확률 이론(조건부확률) : P(B|A) = P(A|B).P(B) / P(A) 
'''
 P(yes|맑은날) = P(맑은날|yes) * P(yes) / P(맑은날)
'''

P =  (2/8) * (8/20) / (10/20) # 확률 계산 
print(f'P(yes|맑은날) = {P*100}%')  # 결과 출력 : P(yes|맑은날) = 20.0%



### [문제2] 흐린날 비가 안올 확률 구하기 
'''
조건부확률 표현 : P(no|흐린날) = P(흐린날|no) * P(no) / P(흐린날)
'''

# 단계1. 사전확률  
'''
P(흐린날) = 10/20
P(no) = 12/20
'''

# 단계2. 결합확률 
'''
P(흐린날|no) = 4/12 :  : 비가 오지 않은 경우 흐린날
'''


# 단계3. 베이즈 확률 이론(조건부확률)
'''
 P(no|흐린날) = P(흐린날|no) * P(no) / P(흐린날)
'''
 
P =  (4/12) * (12/20) / (10/20)  # 확률 계산 
print(f'P(no|흐린날) = {P*100}%') # 결과 출력 : P(no|흐린날) = 40.0%




