"""
SVD(Singular Value Decomposition) : 특이값을 이용한 행렬분해  
"""

import numpy as np # np.linalg

# 1. A행렬 만들기 
A = np.arange(1, 7).reshape(2,3)
print(A)
'''
[[1 2 3]
 [4 5 6]]
'''

# 2. svd : 행렬분해 
U, S, V = np.linalg.svd(A) 

U # u행렬 : 행(사용자) 특징
'''
array([[-0.3863177 ,  0.92236578],
       [-0.92236578, -0.3863177 ]])
'''
S # 특이값 벡터  
'''
array([9.508032  , 0.77286964])
'''

V # v행렬 : 열(아이템) 특징   
'''
array([[-0.42866713, -0.56630692, -0.7039467 ],
       [-0.80596391, -0.11238241,  0.58119908],
       [ 0.40824829, -0.81649658,  0.40824829]])
'''
U.shape # (2, 2)
np.diag(S).shape # (2, 2)
V.shape # (3, 3) 

# 근사 행렬 
X = U @ np.diag(S) @ V[:2]  # (2, 2) @ (2, 2) @ (2, 3) 
print(X) 
'''
[[1. 2. 3.]
 [4. 5. 6.]]
'''


