'''
문5) 다음과 같은 원문 텍스트를 형태소 분석 후 문장으로 만든 sent_nouns를
     이용하여 문서단어행렬(DTM)를 만드시오. <출력결과> 참고
     
     <출력결과>
         개발  기법  기술  나 데이터 분석 시작 전문가 직업 초반 형태소
     0  0.0  0.0  0.0  0.0  0.0  1.0  1.0  0.0  0.0  0.0  1.0
     1  0.0  0.0  0.0  1.0  1.0  1.0  0.0  0.0  0.0  0.0  0.0
     2  0.0  0.0  0.0  0.0  1.0  1.0  0.0  1.0  1.0  0.0  0.0
     3  1.0  1.0  1.0  0.0  0.0  0.0  0.0  0.0  0.0  1.0  0.0
'''

import pandas as pd 
import numpy as np  

# 원문 텍스트 
'''
형태소 분석을 시작합니다. 나는 데이터 분석을 좋아합니다. 
직업은 데이터 분석 전문가 입니다. Text mining 기법은 2000대 초반에 개발된 기술이다.
'''

# 형태소 분석 후 각 문장의 단어 
sent_nouns = [['형태소', '분석', '시작'], ['나', '데이터', '분석'], ['직업', '데이터', '분석', '전문가'], ['기법', '초반', '개발', '기술']] # 중첩list 

print(sent_nouns) # 중첩 list 
'''
[['형태소', '분석', '시작'], ['나', '데이터', '분석'], ['직업', '데이터', '분석', '전문가'], ['기법', '초반', '개발', '기술']]
'''

#####################################
### 문서단어행렬(DTM) 만들기  
#####################################

# 단계1. 유일한 단어집 만들기  
nouns = []
for sent in sent_nouns :
    nouns.extend(sent)
    
print(nouns) # ['형태소', '분석', '시작', '나', '데이터', '분석', '직업', '데이터', '분석', '전문가', '기법', '초반', '개발', '기술']

# 유일한 단어
unique_nouns = list(set(nouns))

print(unique_nouns)

# 단어 정렬
unique_nouns = sorted(unique_nouns)

# 단계2. 영(zeros) 행렬 만들기 
zeros = np.zeros(shape = (len(sent_nouns), len(unique_nouns))) # (4행:문서개수, 11열 : 단어개수)
print(zeros)

# 단계3. 문서단어행렬(DTM) 만들기 
dtm = pd.DataFrame(zeros, columns=unique_nouns)
print(dtm)
'''
  개발   기법   기술    나  데이터   분석   시작  전문가   직업   초반  형태소
0  0.0  0.0    0.0    0.0  0.0     0.0   0.0   0.0     0.0   0.0   0.0
1  0.0  0.0    0.0    0.0  0.0     0.0   0.0   0.0     0.0   0.0   0.0
2  0.0  0.0    0.0    0.0  0.0     0.0   0.0   0.0     0.0   0.0   0.0
3  0.0  0.0    0.0    0.0  0.0     0.0   0.0   0.0     0.0   0.0   0.0
'''

# 단계4. 문장 단위 단어 카운트
        
for idx, nouns in enumerate(sent_nouns) :
    for noun in nouns :
        dtm.loc[idx, noun] += 1

print(dtm)
'''
    개발   기법   기술    나  데이터   분석   시작  전문가   직업   초반  형태소
0  0.0     0.0   0.0    0.0  0.0    1.0    1.0   0.0     0.0   0.0   1.0
1  0.0     0.0   0.0    1.0  1.0    1.0    0.0   0.0     0.0   0.0   0.0
2  0.0     0.0   0.0    0.0  1.0    1.0    0.0   1.0     1.0   0.0   0.0
3  1.0     1.0   1.0    0.0  0.0    0.0    0.0   0.0     0.0   1.0   0.0
'''

